FixedFixedBeam_Ponding/Fluid/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

solver      displacementLaplacian;
//solver     velocityDisplacement;

displacementLaplacianCoeffs {
    //diffusivity quadratic inverseDistance (interface);
    diffusivity uniform;
}